move 07 from 03 to 09
move 05 from 08 to 09
move 03 from 09 to 05
move 06 from 09 to 02
move 09 from 09 to 03
move 03 from 07 to 03
move 08 from 02 to 03
move 09 from 03 to 01
move 11 from 03 to 08
move 05 from 06 to 09
move 01 from 06 to 03
move 01 from 02 to 07
move 01 from 04 to 08
move 01 from 03 to 09
move 04 from 04 to 03
move 06 from 08 to 03
move 02 from 08 to 02
move 04 from 09 to 03
move 03 from 02 to 05
move 02 from 05 to 04
move 05 from 03 to 04
move 11 from 01 to 04
move 01 from 07 to 06
move 01 from 03 to 05
move 02 from 01 to 09
move 01 from 01 to 04
move 07 from 05 to 08
move 21 from 04 to 06
move 06 from 06 to 02
move 06 from 08 to 09
move 05 from 08 to 05
move 02 from 02 to 07
move 04 from 03 to 07
move 01 from 02 to 06
move 01 from 02 to 05
move 02 from 02 to 07
move 04 from 03 to 07
move 01 from 04 to 06
move 09 from 05 to 03
move 07 from 03 to 04
move 07 from 07 to 03
move 07 from 04 to 01
move 08 from 03 to 05
move 01 from 03 to 05
move 03 from 08 to 02
move 02 from 02 to 09
move 13 from 09 to 04
move 05 from 05 to 03
move 04 from 07 to 06
move 01 from 07 to 04
move 02 from 04 to 02
move 03 from 03 to 04
move 02 from 05 to 02
move 06 from 01 to 07
move 01 from 02 to 08
move 01 from 03 to 08
move 01 from 01 to 06
move 01 from 03 to 04
move 01 from 02 to 06
move 24 from 06 to 01
move 03 from 02 to 03
move 03 from 03 to 05
move 02 from 08 to 06
move 02 from 05 to 04
move 03 from 05 to 01
move 07 from 04 to 08
move 03 from 08 to 09
move 02 from 09 to 05
move 02 from 06 to 03
move 01 from 09 to 08
move 05 from 07 to 05
move 02 from 03 to 01
move 01 from 07 to 01
move 07 from 04 to 07
move 02 from 04 to 08
move 06 from 08 to 06
move 03 from 06 to 09
move 10 from 05 to 01
move 07 from 07 to 01
move 01 from 04 to 09
move 01 from 06 to 03
move 02 from 09 to 07
move 01 from 04 to 02
move 01 from 09 to 05
move 01 from 08 to 05
move 39 from 01 to 08
move 01 from 02 to 05
move 02 from 06 to 09
move 03 from 09 to 05
move 03 from 01 to 06
move 01 from 07 to 02
move 01 from 03 to 02
move 02 from 06 to 02
move 03 from 02 to 03
move 01 from 06 to 02
move 01 from 01 to 08
move 03 from 01 to 02
move 03 from 02 to 04
move 02 from 04 to 05
move 02 from 03 to 08
move 08 from 05 to 02
move 08 from 08 to 02
move 15 from 02 to 07
move 01 from 01 to 05
move 25 from 08 to 07
move 02 from 02 to 04
move 02 from 04 to 03
move 01 from 08 to 04
move 02 from 04 to 06
move 01 from 02 to 01
move 26 from 07 to 02
move 15 from 02 to 01
move 07 from 08 to 09
move 10 from 01 to 06
move 10 from 07 to 02
move 01 from 08 to 01
move 05 from 09 to 08
move 01 from 08 to 09
move 02 from 06 to 09
move 03 from 07 to 01
move 01 from 07 to 01
move 05 from 09 to 02
move 01 from 03 to 01
move 09 from 06 to 03
move 01 from 06 to 01
move 04 from 02 to 04
move 03 from 04 to 08
move 01 from 04 to 01
move 09 from 03 to 01
move 01 from 07 to 06
move 09 from 02 to 05
move 14 from 01 to 06
move 01 from 03 to 08
move 05 from 02 to 06
move 08 from 01 to 08
move 06 from 06 to 08
move 14 from 06 to 07
move 01 from 01 to 07
move 10 from 05 to 04
move 11 from 08 to 05
move 15 from 07 to 01
move 04 from 05 to 06
move 04 from 08 to 09
move 06 from 05 to 03
move 01 from 06 to 09
move 01 from 01 to 06
move 01 from 05 to 08
move 02 from 06 to 02
move 06 from 01 to 05
move 01 from 05 to 08
move 02 from 05 to 04
move 09 from 02 to 09
move 13 from 09 to 08
move 01 from 02 to 01
move 01 from 04 to 08
move 03 from 03 to 01
move 02 from 04 to 05
move 02 from 01 to 05
move 01 from 09 to 03
move 17 from 08 to 01
move 03 from 03 to 02
move 04 from 05 to 01
move 02 from 02 to 04
move 01 from 06 to 01
move 01 from 02 to 08
move 04 from 04 to 06
move 01 from 05 to 09
move 05 from 06 to 08
move 01 from 05 to 04
move 01 from 05 to 06
move 03 from 08 to 06
move 08 from 04 to 05
move 32 from 01 to 07
move 11 from 07 to 06
move 08 from 05 to 03
move 03 from 08 to 07
move 06 from 03 to 09
move 04 from 03 to 08
move 05 from 08 to 02
move 01 from 08 to 05
move 11 from 06 to 03
move 01 from 05 to 02
move 02 from 08 to 06
move 12 from 07 to 08
move 02 from 06 to 02
move 02 from 06 to 04
move 05 from 02 to 05
move 08 from 07 to 02
move 02 from 07 to 01
move 02 from 07 to 06
move 05 from 05 to 04
move 05 from 04 to 07
move 05 from 08 to 02
move 02 from 09 to 07
move 05 from 08 to 04
move 02 from 07 to 03
move 02 from 09 to 03
move 03 from 07 to 09
move 01 from 01 to 08
move 02 from 06 to 01
move 02 from 09 to 08
move 01 from 07 to 08
move 01 from 02 to 05
move 01 from 07 to 09
move 07 from 04 to 03
move 03 from 03 to 06
move 05 from 08 to 06
move 03 from 09 to 05
move 16 from 03 to 01
move 02 from 09 to 01
move 07 from 01 to 08
move 01 from 01 to 02
move 05 from 08 to 02
move 12 from 01 to 04
move 01 from 03 to 05
move 01 from 02 to 09
move 01 from 09 to 04
move 04 from 06 to 05
move 05 from 06 to 01
move 01 from 06 to 05
move 01 from 01 to 04
move 01 from 04 to 07
move 01 from 03 to 07
move 09 from 04 to 06
move 02 from 07 to 08
move 01 from 03 to 04
move 02 from 08 to 09
move 04 from 08 to 04
move 04 from 02 to 08
move 02 from 09 to 07
move 02 from 07 to 08
move 10 from 02 to 04
move 01 from 02 to 01
move 05 from 04 to 07
move 01 from 01 to 03
move 03 from 08 to 07
move 06 from 07 to 02
move 03 from 02 to 07
move 01 from 06 to 07
move 05 from 05 to 08
move 04 from 01 to 03
move 04 from 03 to 01
move 08 from 04 to 02
move 01 from 03 to 02
move 02 from 07 to 02
move 02 from 06 to 03
move 04 from 07 to 02
move 04 from 05 to 07
move 14 from 02 to 07
move 03 from 02 to 01
move 03 from 08 to 02
move 01 from 05 to 07
move 06 from 02 to 04
move 02 from 02 to 07
move 02 from 03 to 06
move 06 from 08 to 02
move 04 from 06 to 04
move 02 from 06 to 09
move 04 from 04 to 02
move 02 from 04 to 08
move 10 from 07 to 02
move 18 from 02 to 06
move 02 from 02 to 06
move 02 from 09 to 02
move 02 from 08 to 05
move 01 from 02 to 09
move 01 from 02 to 09
move 01 from 05 to 07
move 01 from 02 to 06
move 02 from 09 to 02
move 06 from 07 to 03
move 07 from 06 to 08
move 05 from 07 to 02
move 01 from 07 to 04
move 01 from 05 to 07
move 04 from 08 to 07
move 05 from 02 to 03
move 01 from 07 to 05
move 02 from 02 to 08
move 09 from 04 to 03
move 13 from 06 to 08
move 10 from 03 to 01
move 01 from 05 to 02
move 03 from 06 to 08
move 05 from 01 to 02
move 01 from 01 to 08
move 02 from 04 to 03
move 17 from 08 to 06
move 05 from 06 to 03
move 03 from 01 to 02
move 09 from 06 to 05
move 02 from 06 to 08
move 05 from 05 to 09
move 03 from 09 to 08
move 03 from 01 to 03
move 03 from 07 to 05
move 06 from 05 to 08
move 07 from 02 to 04
move 01 from 06 to 03
move 01 from 01 to 05
move 04 from 04 to 05
move 02 from 02 to 09
move 03 from 01 to 03
move 04 from 05 to 08
move 01 from 04 to 05
move 06 from 08 to 07
move 01 from 05 to 02
move 04 from 09 to 02
move 02 from 05 to 09
move 02 from 01 to 08
move 02 from 04 to 09
move 06 from 07 to 05
move 03 from 05 to 02
move 03 from 02 to 05
move 10 from 08 to 03
move 02 from 08 to 05
move 03 from 02 to 05
move 06 from 05 to 01
move 04 from 05 to 06
move 01 from 07 to 05
move 23 from 03 to 07
move 02 from 05 to 09
move 02 from 01 to 05
move 02 from 06 to 03
move 06 from 03 to 01
move 01 from 01 to 07
move 04 from 03 to 01
move 01 from 08 to 05
move 02 from 09 to 02
move 03 from 03 to 08
move 02 from 06 to 08
move 12 from 01 to 03
move 01 from 09 to 07
move 03 from 05 to 09
move 09 from 03 to 08
move 01 from 01 to 07
move 01 from 09 to 04
move 03 from 03 to 06
move 03 from 02 to 01
move 03 from 08 to 06
move 01 from 04 to 02
move 01 from 02 to 09
move 01 from 02 to 07
move 20 from 07 to 05
move 03 from 07 to 03
move 03 from 01 to 03
move 05 from 08 to 01
move 05 from 01 to 05
move 04 from 05 to 02
move 03 from 02 to 06
move 03 from 08 to 07
move 01 from 02 to 06
move 02 from 08 to 06
move 02 from 07 to 05
move 02 from 03 to 06
move 12 from 05 to 01
move 06 from 05 to 07
move 12 from 06 to 08
move 04 from 09 to 03
move 04 from 05 to 08
move 03 from 01 to 05
move 04 from 07 to 04
move 03 from 05 to 09
move 07 from 01 to 06
move 01 from 01 to 03
move 06 from 07 to 06
move 01 from 01 to 03
move 10 from 03 to 06
move 10 from 06 to 02
move 02 from 09 to 05
move 04 from 06 to 05
move 09 from 06 to 01
move 16 from 08 to 07
move 03 from 08 to 07
move 01 from 08 to 01
move 07 from 02 to 01
move 01 from 05 to 09
move 01 from 06 to 01
move 02 from 02 to 01
move 03 from 01 to 04
move 01 from 06 to 08
move 07 from 04 to 01
move 01 from 08 to 02
move 22 from 01 to 08
move 18 from 07 to 09
move 06 from 05 to 02
move 02 from 02 to 07
move 02 from 01 to 05
move 04 from 07 to 06
move 01 from 05 to 06
move 02 from 08 to 02
move 03 from 02 to 06
move 01 from 05 to 06
move 15 from 09 to 06
move 06 from 09 to 05
move 01 from 09 to 08
move 01 from 02 to 09
move 05 from 05 to 09
move 09 from 08 to 06
move 03 from 02 to 07
move 12 from 08 to 09
move 01 from 07 to 05
move 01 from 05 to 07
move 03 from 07 to 01
move 17 from 06 to 03
move 01 from 02 to 06
move 02 from 01 to 04
move 16 from 06 to 04
move 07 from 04 to 06
move 01 from 05 to 07
move 08 from 04 to 05
move 09 from 09 to 08
move 16 from 03 to 07
move 01 from 01 to 05
move 03 from 05 to 01
move 05 from 06 to 02
move 03 from 01 to 07
move 03 from 06 to 07
move 03 from 09 to 03
move 05 from 08 to 05
move 11 from 05 to 07
move 02 from 03 to 07
move 01 from 02 to 01
move 01 from 03 to 06
move 17 from 07 to 09
move 01 from 03 to 02
move 03 from 04 to 06
move 01 from 01 to 02
move 01 from 06 to 04
move 14 from 07 to 06
move 15 from 09 to 06
move 04 from 08 to 07
move 01 from 04 to 07
move 07 from 09 to 05
move 05 from 02 to 09
move 07 from 05 to 01
move 03 from 01 to 07
move 29 from 06 to 04
move 01 from 02 to 04
move 18 from 04 to 02
move 03 from 01 to 04
move 01 from 01 to 07
move 18 from 02 to 04
move 03 from 06 to 05
move 15 from 04 to 01
move 01 from 05 to 01
move 01 from 05 to 04
move 09 from 04 to 01
move 05 from 01 to 03
move 09 from 01 to 05
move 02 from 04 to 03
move 05 from 05 to 06
move 03 from 07 to 09
move 07 from 07 to 05
move 06 from 04 to 06
move 02 from 03 to 07
move 06 from 05 to 08
move 02 from 08 to 04
move 01 from 08 to 09
move 09 from 06 to 02
move 03 from 09 to 03
move 01 from 02 to 01
move 06 from 07 to 04
move 02 from 02 to 08
move 03 from 09 to 05
move 05 from 04 to 08
move 01 from 06 to 09
move 01 from 03 to 01
move 01 from 03 to 04
move 01 from 06 to 05
move 01 from 09 to 03
move 10 from 08 to 07
move 03 from 09 to 02
move 07 from 02 to 04
move 06 from 05 to 07
move 04 from 05 to 08
move 07 from 03 to 02
move 03 from 07 to 01
move 09 from 01 to 05
move 05 from 07 to 09
move 07 from 01 to 04
move 11 from 04 to 02
move 04 from 08 to 03
move 05 from 04 to 07
move 04 from 04 to 01
move 01 from 03 to 06
move 12 from 07 to 04
move 02 from 01 to 08
move 05 from 09 to 07
move 07 from 05 to 06
move 01 from 01 to 04
move 01 from 09 to 08
move 01 from 04 to 07
move 01 from 08 to 09
move 05 from 07 to 09
move 02 from 07 to 05
move 02 from 06 to 03
move 05 from 02 to 07
move 01 from 07 to 08
move 01 from 01 to 06
move 03 from 05 to 01
